<!-- Assignment 1
Create a Series object from a list of 10 items using a customized index values.
Create a Series object from a dictionary of 10 items.
Create a DataFrame object from a Series object with a customized index values
Create a DataFrame object generated from random values of 5 rows by 5 columns numpy array. Give each columns a title and each index a name.
Separate the DataFrame in number 4 to its individual Index, Values and Colomns -->

In [2]:
import numpy as np
import pandas as pd

In [3]:
# 1. Create a Series object from a list of 10 items using a customized index values.
Datarecord = pd.Series([100, 200, 300, 400, 500, 600, 700, 800, 900, 1000], index=["A", "B", "C", "D", "E", "F", "G", "H", "I", "J"] )
Datarecord

A     100
B     200
C     300
D     400
E     500
F     600
G     700
H     800
I     900
J    1000
dtype: int64

In [3]:
# 2. Create a Series object from a dictionary of 10 items.
studentNameAge = {'Aliyu':22, 'Shalom':17, 'Samuel':25, 'Umar':36, 'Meshak':34, 'Ibrahim':23, "Ayo":29, "Grace":20, "Joshua":30, "Daniel":25 }
Name = pd.Series(studentNameAge)
Name

Aliyu      22
Shalom     17
Samuel     25
Umar       36
Meshak     34
Ibrahim    23
Ayo        29
Grace      20
Joshua     30
Daniel     25
dtype: int64

In [4]:
# 3. Create a DataFrame object from a Series object with a customized index values

planet = pd.Series(['Jupiter', 'Mars', 'Earth', 'Saturn', 'Mercury', 'Uranus','Venus', 'Neptune', 'Pluto'], index=[1, 2, 3, 4, 5, 6, 7, 8, 9])
df =pd.DataFrame(planet)
df

         0
1  Jupiter
2     Mars
3    Earth
4   Saturn
5  Mercury
6   Uranus
7    Venus
8  Neptune
9    Pluto

In [6]:
# 4. Create a DataFrame object generated from random values of 5 rows by 5 columns numpy array. Give each columns a title and each index a name.

studentName = pd.DataFrame(np.random.rand(5,5), columns=['Micheal', "Amos", "Aliyu", "jarmai", "maigida"], index=['row1', 'row2', 'row3', "row4", "row5"])
studentName

       Micheal      Amos     Aliyu    jarmai   maigida
row1  0.921591  0.292874  0.031692  0.847414  0.460356
row2  0.961066  0.031231  0.540235  0.834689  0.330959
row3  0.906471  0.478306  0.969139  0.038216  0.940394
row4  0.144302  0.631728  0.293511  0.699717  0.911345
row5  0.823522  0.432524  0.368677  0.821783  0.083924

In [7]:
# 5. Separate the DataFrame in number 4 to its individual Index, Values and Colomns
studentName.index

Index(['row1', 'row2', 'row3', 'row4', 'row5'], dtype='object')

In [8]:
studentName.values

array([[0.92159129, 0.29287358, 0.03169152, 0.84741393, 0.46035581],
       [0.96106554, 0.03123124, 0.54023535, 0.83468923, 0.33095901],
       [0.90647067, 0.47830631, 0.96913881, 0.03821641, 0.94039372],
       [0.14430204, 0.63172824, 0.29351056, 0.69971681, 0.9113452 ],
       [0.82352222, 0.43252427, 0.3686768 , 0.82178271, 0.08392377]])

In [10]:
studentName.columns

Index(['Micheal', 'Amos', 'Aliyu', 'jarmai', 'maigida'], dtype='object')